# Assignment 1 - 1

In [426]:
import pandas as pd
df = pd.read_csv('D:/Загрузки/athlete_events.csv')

In [173]:
df.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [233]:
df[df['Year']==1992].pivot_table(['Age'], ['Sex'], aggfunc = ['min', 'max'])

      min   max
      Age   Age
Sex
F    12.0  53.0
M    11.0  62.0

# 2

In [125]:
df2 = df.drop_duplicates(['Name'])

In [256]:
a = df2[(df2['Sex']=='M') & (df2['Year']==2012)].count()

In [255]:
b = df2[(df2['Sex']=='M') & (df2['Year']==2012) & (df2['Sport']=='Basketball')].count()

In [257]:
perc = 100*b[0]/a[0]
round(perc, 1)

2.7


# 3

In [260]:
c=df['Height'][(df['Sex']=='F') & (df['Year']==2000) & (df['Sport']=='Tennis')].dropna().describe()
c

count    125.000000
mean     171.792000
std        6.458673
min      150.000000
25%      168.000000
50%      172.000000
75%      176.000000
max      191.000000
Name: Height, dtype: float64

# 4

In [254]:
df[(df['Weight'] == (df['Weight'][df['Year']==2006].max())) & (df['Year']==2006)]

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
8102,4476,Patrick R. Antaki,M,41.0,185.0,127.0,Lebanon,LIB,2006 Winter,2006,Winter,Torino,Skeleton,Skeleton Men's Skeleton,NaN

# 5

In [274]:
df[df['Name'] == 'John Aalberg'].groupby('Year').count()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Season,City,Sport,Event,Medal
Year,,,,,,,,,,,,,,
1992,4,4,4,4,4,4,4,4,4,4,4,4,4,0
1994,4,4,4,4,4,4,4,4,4,4,4,4,4,0

In [291]:
d = pd.unique(df['Year'][df['Name'] == 'John Aalberg'])

In [296]:
import numpy as np
np.array(d)
e = 0
for element in d.tolist():
    e+=1
print(e)

2

# 6

In [305]:
df[(df['Year'] == 2008) & (df['Team'] == 'Switzerland') & (df['Medal'] == 'Gold') & (df['Sport']=='Tennis')].count()

ID        2
Name      2
Sex       2
Age       2
Height    2
Weight    2
Team      2
NOC       2
Games     2
Year      2
Season    2
City      2
Sport     2
Event     2
Medal     2
dtype: int64

# 7

In [317]:
df['Medal'][(df['Year'] == 2016) & (df['Team'] == 'Spain')].count() < df['Medal'][(df['Year'] == 2016) & (df['Team'] == 'Italy')].count()

True

# 8

In [374]:
s = df['Age'][(df['Year'] == 2008)].tolist()
cnt, cnt2, cnt3, cnt4 = 0, 0, 0, 0
for element in s:
    if element in np.arange(15, 26):
        cnt+=1
    elif element in np.arange(25, 36):
        cnt2+=1
    elif element in np.arange(35, 46):
        cnt3+=1
    elif element in np.arange(45, 56):
        cnt4+=1
print(cnt,'спортсменов возраста 15-25 лет')
print(cnt2,'спортсменов возраста 25-35 лет')
print(cnt3,'спортсменов возраста 35-45 лет')
print(cnt4,'спортсменов возраста 45-55 лет')

7352 спортсменов возраста 15-25 лет
5504 спортсменов возраста 25-35 лет
623 спортсменов возраста 35-45 лет
91 спортсменов возраста 45-55 лет

# 9

In [385]:
int(np.unique(df['Year'][(df['Season'] == 'Summer') & (df['City'] == 'Atlanta')]))

1996

In [386]:
int(np.unique(df['Year'][(df['Season'] == 'Winter') & (df['City'] == 'Squaw Valley')]))

1960

# 10

In [440]:
len(df['Sport'][df['Year'] == 1986].unique())

0

In [439]:
len(df['Sport'][df['Year'] == 2002].unique())

15